femat7/tutorials/lagrangian/coalChemistryFoam/simplifiedSiwek/0/G
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      G;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -3 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    top
    {
        type            MarshakRadiation;
        emissivityMode  lookup;
        emissivity      uniform 1.0;
        value           uniform 0;
    }
    bottom
    {
        type            MarshakRadiation;
        emissivityMode  lookup;
        emissivity      uniform 1.0;
        value           uniform 0;
    }
    walls
    {
        type            MarshakRadiation;
        emissivityMode  lookup;
        emissivity      uniform 1.0;
        value           uniform 0;
    }
    symmetry
    {
        type            symmetryPlane;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
